Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: དེ་ལ་སྒྲུབ་པ་ནི་བྱང་ཆུབ་ཏུ་སྨོན་པའོ། །བག་མཆིས་པ་ནི་སྨོན་ལམ་ཡོངས་སུ་སྐོང་བའོ། །
en: The practice is the aspiration to awaken, and vigilance is to fulfill that aspiration.

source: གཞན་ཡང་སྒྲུབ་པ་ནི་སྦྱིན་པ་ལ་སྦྱོར་བའོ། །བག་མཆིས་པ་ནི་རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བའོ། །
en: Additionally, the practice is to cultivate giving, and vigilance is to not hope for a result.

source: སྒྲུབ་པ་ནི་ཚུལ་ཁྲིམས་ཀྱི་སྡོམ་པ་ཡང་དག་པར་བླངས་པ་མ་ཉམས་པའོ། །བག་མཆིས་པ་ནི་ཕྱིར་མི་ལྡོག་པའི་ཚུལ་ཁྲིམས་སྒྲུབ་པའོ། །
en: The practice is to take on a commitment to discipline and not let it weaken, and vigilance is to perfect irreversible discipline.

source: སྒྲུབ་པ་ནི་བཟོད་པ་རྩོམ་པའོ། །བག་མཆིས་པ་ནི་མི་སྐྱེ་བའི་ཆོས་རྟོགས་པའོ། །
en: The practice is to begin cultivating acceptance, and vigilance is to realize that phenomena do not arise.

source: སྒྲུབ་པ་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་ཀུན་དུ་ཚོལ་བས་ཡོངས་སུ་མི་སྐྱོ་བའོ། །བག་མཆིས་པ་ནི་རྩོམ་པ་ཐམས་ཅད་ཡོངས་སུ་འདོར་བའོ། །
en: The practice is to not grow weary from seeking every root of virtue, and vigilance is to go beyond striving.

source: སྒྲུབ་པ་ནི་བསམ་གཏན་རྩོམ་པའོ། །བག་མཆིས་པ་ནི་མི་གནས་པའི་བསམ་གཏན་པའོ། །
en: The practice is to begin cultivating meditative stability, and vigilance is meditative stability that is not fixated.

source: སྒྲུབ་པ་ནི་ཤེས་རབ་ཡོངས་སུ་སྐོང་བའོ། །བག་མཆིས་པ་ནི་ཆོས་ཐམས་ཅད་སྤྲོས་པར་མི་བགྱིད་པའོ། །
en: The practice is to be filled with insight, and vigilance is to not conceptualize any phenomena.

source: སྒྲུབ་པ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པའོ། །བག་མཆིས་པ་ནི་ཆོས་ཐམས་ཅད་མི་དམིགས་པའོ། །
en: The practice is to uphold the sublime Dharma, and vigilance is to not conceptually fixate on any phenomena.

source: སྒྲུབ་པ་ནི་སེམས་ཅན་རྣམས་བྱང་ཆུབ་ལ་རབ་ཏུ་འགོད་པའོ། །བག་མཆིས་པ་ནི་སེམས་ཅན་རྣམས་མི་དམིགས་པའོ། །
en: The practice is to establish all beings in awakening, and vigilance is to not conceptually fixate on any being.

source: སྒྲུབ་པ་ནི་དགེ་བའི་རྩ་བ་ཐམས་ཅད་བགྱིས་ནས་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བའོ། །བག་མཆིས་པ་ནི་ཆོས་ཐམས་ཅད་བྱང་ཆུབ་ཀྱི་ངོ་བོ་ཉིད་དུ་རྟོགས་པའོ། །
en: The practice is to cultivate all roots of virtue and dedicate them to awakening, and vigilance is to realize that all phenomena are the essence of awakening.

source: སྒྲུབ་པ་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པའོ། །བག་མཆིས་པ་ནི་བསམས་བཞིན་དུ་སྲིད་པ་ཡོངས་སུ་འཛིན་པའོ། །
en: The practice is to attain acceptance of the nonarising of phenomena, and vigilance is to intentionally maintain existence.

source: སྒྲུབ་པ་ནི་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འགྲོ་བའི་བཀོད་པ་ཀུན་ཏུ་སྟོན་པའོ། །བག་མཆིས་པ་ནི་བསྐལ་པ་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་ན་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའོ། །
en: The practice is to display the appearance of proceeding to the seat of awakening, and vigilance is taking unfathomable, incalculable eons to reach perfect awakening.

source: སྒྲུབ་པ་ནི་བྱང་ཆུབ་མངོན་པར་འཚང་རྒྱའོ། །བག་མཆིས་པ་ནི་སྔར་བགྱི་བ་བགྱིས་པའོ། །
en: The practice is reaching awakening, and vigilance is to have done the preliminary work.

source: སྒྲུབ་པ་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཆེན་པོར་ཉེ་བར་མཆི་བའོ། །བག་མཆིས་པ་ནི་ཆོས་ཤིན་ཏུ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འཚལ་བ་སྟེ།
en: The practice is to arrive at the great final nirvāṇa, and vigilance is to seek the Dharma in utterly final nirvāṇa.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲུབ་པ་འདི་ལྟ་བུ་དང་། བག་མཆིས་པ་འདི་ལྟ་བུ་དང་ལྡན་པ་ནི་བྱང་ཆུབ་རྙེད་པར་དཀའ་བ་མ་ལགས་སོ། །
en: Blessed One, it is rare to find a bodhisattva who practices in these ways and is vigilant in these ways.

source: བཅོམ་ལྡན་འདས་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔས་སྒྲུབ་པ་འདི་དང་། བག་མཆིས་པ་འདི་ལ་བརྩོན་པར་བགྱི་སྟེ།
en: Blessed One, bodhisattvas should therefore endeavor to practice this, and to be vigilant in this.

source: བཅོམ་ལྡན་འདས་འདི་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་ལགས་སོ། །
en: Blessed One, this is a discourse on the Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བློ་གྲོས་རྣམ་པར་གནོན་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཆོས་ཡང་དག་པར་འཛིན་པ་ཞིག་ལ་གནས་ནས་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཡང་དག་པར་སྒྲུབ་སྟེ།
en: The bodhisattva great being Mativikrama next addressed the Blessed One: “Blessed One, bodhisattvas who fully understand the Dharma persist in it and achieve awakening.

source: དེ་ལ་ཁ་ཅིག་ནི་འདི་སྙམ་དུ་གང་སངས་རྒྱས་སངས་རྒྱས་ཞེས་བྱ་བ་འདི་ཆོས་གང་གི་མིང་དུ་སངས་རྒྱས་ཞེས་བཏགས་སྙམ་དུ་སེམས་ཏེ།
en: About this some think, ‘The term buddha applied to buddhas is the label buddha applied as the name of a phenomenon.’

source: དེ་དག་དེ་ལྟར་རྟོག་པ་ན་གང་འདི་སངས་རྒྱས་ཞེས་བགྱི་བའི་ཆོས་དེ་དག་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་དག་སངས་རྒྱས་ཇི་ལྟ་བ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཁོང་དུ་ཆུད་དོ། །
en: If they think in this way, then they correctly cannot identify a phenomenon to which buddha is applied and understand all phenomena in the same way as a buddha.

source: དེ་དག་དེ་ལྟར་ཡོངས་སུ་ཤེས་པ་དང་ལྡན་པས་གང་ཅི་ཡིད་ལ་བགྱིད་པ་དེ་དག་ཐམས་ཅད་སངས་རྒྱས་ཐོབ་པར་བགྱིད་པ་ལགས་སོ། །
en: Through this understanding they bring about the attainment of buddhahood no matter what they direct their attention to.

source: ལ་ལ་ནི་འདི་སྙམ་དུ་སེམས་ཏེ། གང་ཆོས་ཆོས་ཞེས་བྱ་བའི་ཆོས་འདི་ནི་ཡུལ་ན་མི་གནས་ཕྱོགས་ན་མི་གནས་ཏེ།
en: “Some think, ‘A phenomenon to which the term phenomenon is applied is not present in an object or in a location.

source: གཞན་དུ་ན་ཆོས་རང་གི་སེམས་ལ་རག་ལས་པ་ནི་མེད་པ་མ་ཡིན་ནོ། །
en: Rather, it is dependent on one’s own mind and is not nonexistent.

source: དེ་བས་ན་བདག་གིས་རང་གི་སེམས་ཤིན་ཏུ་བཟུང་བ་དང་། ཤིན་ཏུ་མཐར་གཏུགས་པ་དང་། ཤིན་ཏུ་ཐུལ་བ་དང་། ཤིན་ཏུ་མཉམ་པར་བརྩམ་པ་དང་། ཤིན་ཏུ་ཚར་གཅད་པར་བྱའོ། །
en: Therefore, I should understand my own mind well, settle it well, control it well, orient it well, and keep it in check.

source: སེམས་གང་ཡིན་པ་དེ་ལ་ནི་ཡོན་ཏན་དང་ཉེས་པ་རྣམས་ཡོད་ཀྱིས་སེམས་མེད་པ་ལ་ནི་ཡོན་ཏན་དང་ཉེས་པ་རྣམས་མེད་དོ་སྙམ་སྟེ།
en: Where there is mind, there are qualities and faults; there are no qualities or faults where there is no mind.’

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཉེས་པ་རྣམས་ལས་སེམས་བཟློག་ནས་ཡོན་ཏན་རྣམས་ལ་འཇུག་སྟེ།
en: Bodhisattvas turn their minds away from faults and engage with qualities.

source: དེ་བས་ན་ཆོས་ནི་སེམས་ལ་རག་ལས་བྱང་ཆུབ་ནི་ཆོས་ལ་རག་ལས་ཞེས་བྱའོ། །
en: Therefore, it is said that phenomena depend on mind, and awakening depends on phenomena.

source: བཅོམ་ལྡན་འདས་འདི་ཆོས་ཡང་དག་པར་འཛིན་པ་ལགས་ཏེ། བདེ་བར་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འགྱུར།
en: Blessed One, this is one understanding of the Dharma that leads to the easy attainment of perfect awakening.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་གི་ཡང་དག་པར་འཛིན་པ་ནི་འདི་ལགས་སོ། །གང་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བར་མཚུངས་པར་འཇུག་པའི་སེམས་དེ་ནི་སེམས་ཏེ། གང་སེམས་འདི་འདྲ་བ་དང་མི་ལྡན་པ་དེ་ནི་སེམས་ཅན་རྣམས་ལ་ལོག་པར་ཞུགས་པའོ། །
en: “Blessed One, there is another understanding of the Dharma held by some bodhisattvas: ‘Mind refers to the mind that engages equally in the benefit and happiness of all beings; those who lack such a mind act adversely toward beings.

source: སེམས་ཅན་གྱི་ཞིང་ནི་བྱང་ཆུབ་སེམས་དཔའི་སངས་རྒྱས་ཀྱི་ཞིང་ངོ་། །
en: A field of beings is a buddhafield for bodhisattvas.

source: སངས་རྒྱས་ཀྱི་ཞིང་གང་ལ་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་རྙེད་ཅིང་ཐོབ་པར་འགྱུར་བ་དེ་ལ་ལོག་པར་འཇུག་པར་བྱ་བའི་མི་རིགས་སོ་སྙམ་མོ། །
en: It is inappropriate to act adversely in a buddhafield in which the qualities of a buddha can be found and attained.

source: དེ་ཡང་འདི་སྙམ་དུ་སེམས་ཏེ། ལེགས་པར་སྤྱོད་པ་དང་། ཉེས་པར་སྤྱོད་པ་ཐམས་ཅད་ཀྱང་སེམས་ལ་བརྟེན་ནས་འབྱུང་སྟེ།
en: They also think that good conduct and bad conduct occur in dependence on the basis of beings.

source: ཉེས་པར་སྤྱོད་པ་ལ་གནས་པ་ནི་ངན་སོང་དུ་སྐྱེའོ། །ལེགས་པར་སྤྱོད་པ་ལ་གནས་པ་ནི་ལྷ་དང་མིར་སྐྱེའོ། །
en: Maintaining bad conduct leads to birth in the lower realms, while maintaining good conduct leads to birth among gods and humans.

source: དེ་གཉི་ག་ཡོངས་སུ་སྤངས་པ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་སུ་འགྱུར་རོ་སྙམ་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཡང་དག་པར་འཛིན་པ་ལགས་ཏེ།
en: One becomes a blessed buddha by abandoning both.’

source: མྱུར་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འགྱུར་བའོ། །
en: This is a bodhisattva’s understanding of the Dharma, which quickly leads to perfect awakening.

source: ཁ་ཅིག་ནི་ཆོས་ཡང་དག་པར་འཛིན་པ་ནི་འདི་ལྟ་བུ་ལགས་ཏེ། འདི་དག་ཐམས་ཅད་ནི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ཙམ་དུ་ཟད་དེ། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལས་རྣམ་པར་གྲོལ་བའི་ཆོས་གང་ཡང་མེད་དོ། །
en: “Some understand the Dharma as follows: ‘Everything is included within the process of dependent arising; there is no phenomenon that is beyond dependent arising.

source: གང་རྟེན་ནས་འབྱུང་བའི་ཆོས་དེ་གང་ཞེ་ན།
en: What is a phenomenon that arises dependently?

source: གང་རྟེན་ཏེ་བྱུང་བ་ནི་མ་སྐྱེས་པ་སྟེ་ངོ་བོ་ཉིད་ཀྱིས་ཡོངས་སུ་གྲུབ་པའི་ཆོས་དེ་གང་ཡང་མེད་དེ།
en: A phenomenon that arises dependently does not arise, as there is no phenomenon that can be intrinsically established.

source: གཞན་དུ་ན་བསྟན་པ་ཙམ་དང་། ཐ་སྙད་ཙམ་དང་། བཏགས་པ་ཙམ་དང་། བརྡ་ཙམ་དང་། དོན་དམ་པར་མངོན་པར་བྱེད་པ་ཙམ་ནི་མེད་པ་མ་ཡིན་ནོ་སྙམ་མོ། །
en: Rather, that which is mere description, mere convention, mere designation, mere symbol, and that which is limited to indicating the ultimate, is not nonexistent.’

source: འདི་ནི་སྟོན་པ་པོའི་ཆོས་ཡང་དག་པར་འཛིན་པ་སྟེ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པའི་སྙིང་པོ་ལགས་སོ། །
en: This is an understanding of the Dharma of the Teacher and is the essence of the Dharma taught by all the buddhas.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཁ་ཅིག་ནི་འདི་སྙམ་དུ་སེམས་ཏེ། སྐྱེ་བ་ཞེས་བྱ་བ་འདི་ཆོས་གང་གི་མིང་དུ་སྐྱེ་བ་ཞེས་བྱ་སྙམ་ནས།
en: “Blessed One, some bodhisattvas think, ‘This thing called birth is a term used to name a phenomenon.’

source: དེས་གང་འདི་སྐྱེ་བ་ཞེས་བགྱི་བའི་ཆོས་དེ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: Thinking this, they correctly cannot identify a phenomenon to which the term birth can be applied.

source: དེ་འདི་སྙམ་དུ་སེམས་པ་དང་ལྡན་པས་ཆོས་ཐམས་ཅད་ནི་མ་སྐྱེས་སོ་སྙམ་དུ་བཟོད་པ་སྐྱེས་སོ། །
en: One who thinks this way thinks, ‘All phenomena are unarisen,’ and generates acceptance.

source: ཁ་ཅིག་ནི་འདི་སྙམ་དུ་སེམས་ཏེ། གང་འཆི་བ་ཞེས་བྱ་བ་འདི་འདིར་ཆོས་ཅི་ཞིག་འགགས།
en: Some think, ‘This thing called death is the cessation of a given present phenomenon.

source: གང་འགགས་པས་འཆི་བ་ཞེས་བྱ་སྙམ་སྟེ།
en: Something is dead because it ceases.’

source: དེ་དེ་ལྟར་སོ་སོར་རྟོག་པ་ན་གང་འགགས་པས་འཆི་བ་ཞེས་བགྱི་བའི་ཆོས་དེ་དག་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །
en: Once they have discerned this, they correctly cannot identify a phenomenon that can be described using the statement, ‘Something is dead because it ceases.’

source: འདི་ནི་ཆོས་ཡང་དག་པར་འཛིན་པ་སྟེ། བདུད་རྩི་ཁོང་དུ་ཆུད་པར་འགྱུར་བའོ། །
en: This is an understanding of the Dharma, and an understanding of deathlessness.

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐུགས་ནི་ཆོས་ཐམས་ཅད་ལ་མི་ཆགས་པ་ལགས་ཏེ། དེ་དག་ནི་ཡིད་དང་གནས་པ་མ་མཆིས་པ་རྣམས་ཀྱིས་མཉེས་པར་བགྱིའོ། །
en: “Blessed One, the minds of the blessed buddhas are not attached to anything, and they are gladdened by those who are without mental fixation.

source: བཅོམ་ལྡན་འདས་ཆོས་ནི་སྒྲིབ་པ་མ་མཆིས་པ་ལགས་ཏེ།
en: Blessed One, the Dharma is unobscured.

source: དེ་ནི་སེམས་སྒྲིབ་པ་མ་མཆིས་པ་རྣམས་ཀྱིས་འཐོབ་བོ། །
en: It is attained by those whose minds are unobscured.

source: བཅོམ་ལྡན་འདས་ཆོས་མཉམ་པ་ནི་བྱང་ཆུབ་ལགས་ཏེ།
en: Blessed One, the equality of phenomena is awakening.

source: དེ་ནི་སེམས་མི་མཉམ་པ་མ་མཆིས་པ་རྣམས་ཀྱིས་རྟོགས་པའོ། །
en: It is realized by those who do not have minds that fail to recognize equality.

source: བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་ཚོལ་བ་དེ་ཙམ་དུ་འཆིང་བའོ། །
en: Blessed One, one is bound to the extent that one seeks.

source: མི་ཚོལ་བ་ནི་ཐར་པའོ། །
en: Not seeking is liberation.

source: དེ་བས་ན་ཐར་པ་ཚོལ་བས་ཚོལ་བ་ཐམས་ཅད་མི་བཙལ་བར་བགྱི་སྟེ།
en: Therefore, those who seek liberation should not get involved in any seeking.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་ཆོས་ཡང་དག་པར་བརྗོད་པ་ཞེས་བགྱི་བ་འདི་ནི་མཉམ་པའི་ཚིག་གོ། །
en: “Furthermore, Blessed One, the phrase ‘discourse on the Dharma’ is an expression of equality.

source: འདི་ནི་ཟབ་པའི་ཚིག་གོ། །འདི་ནི་ལེན་པ་མ་མཆིས་པའི་ཚིག་གོ། །འདི་ནི་གཞི་མ་མཆིས་པའི་ཚིག་གོ། །འདི་ནི་ཀུན་གཞི་མ་མཆིས་པའི་ཚིག་གོ། །འདི་ནི་རྟེན་མ་མཆིས་པའི་ཚིག་གོ། །
en: It is an expression of the profound, an expression without grasping, an expression without basis, an expression without foundation, an expression without support, an expression of how things are, an expression of suchness, and an expression of unerring suchness.

source: འདི་ནི་དེ་ཁོ་ན་དང་། དེ་བཞིན་ཉིད་དང་། མ་ནོར་བ་དེ་བཞིན་ཉིད་ཀྱི་ཚིག་སྟེ། བཅོམ་ལྡན་འདས་འདི་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་ལགས་སོ། །
en: Blessed One, this is a discourse on the Dharma.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་བདག་གིས་འཚལ་བ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་དག་དེ་བཞིན་གཤེགས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་དག་གིས་བཤད་པ་རྣམས་ཐོས་སམ། ཐོས་ནས་ཀྱང་དད་ཅིང་དེ་བཞིན་ཉིད་དུ་སྒྲུབ་པ་དེ་དག་ལ་ཆོས་ཡང་དག་པར་བརྗོད་པ་མ་མཆིས་སྙམ་བགྱིད་དོ། །
en: The venerable Śāriputra next addressed the Blessed One: “Blessed One, based on my understanding of what the Blessed One said, I wonder, is there no Dharma discourse for those bodhisattva great beings who heard these instructions by the Thus-Gone One and the bodhisattva great beings, and upon hearing them, felt trust and conviction?

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why do I ask?

source: མི་མོས་པ་མང་བ་ལ་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་མ་མཆིས། བགྱི་བ་མ་བརྩམས་པ་ལ་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་མ་མཆིས་ཀྱི།
en: There is no Dharma discourse for the many people who lack interest, nor is there a Dharma discourse for those who do not take up the work.

source: གང་འཕགས་པས་བཤད་པའི་ཆོས་རྣམས་ལ་དཀོན་པར་འདུ་ཤེས་པ་དང་། རིན་པོ་ཆེར་འདུ་ཤེས་པ་དང་། སྨན་དུ་འདུ་ཤེས་པ་དེ་དག་ལ་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་མཆིས།
en: Instead, there is a Dharma discourse for those who believe that the Dharma teachings of the noble ones are rare and precious, that they are medicine.

source: བཅོམ་ལྡན་འདས་གང་བདག་ལ་མི་སྟོད་པ་དང་། གཞན་ལ་མི་སྨོད་པ་དེ་དག་ལ་ཆོས་ཡང་དག་པར་བརྗོད་པ་མཆིས།
en: Blessed One, there is a Dharma discourse for those who do not praise themselves or disparage others.

source: བཅོམ་ལྡན་འདས་གང་འཕགས་པ་རྣམས་ལ་བྱམས་པའི་སེམས་དང་། འཕགས་པ་མ་ཡིན་པ་རྣམས་ལ་རྗེས་སུ་འཛིན་པའི་སེམས་དང་ལྡན་པ་དེ་དག་ལ་ཆོས་ཡང་དག་པར་བརྗོད་པ་མཆིས།
en: Blessed One, there is a Dharma discourse for those who feel affection for the noble ones and who help the ignoble.

source: གང་བདག་རྒྱ་ཆེ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། གཞན་དམན་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེ་དག་ལ་ཆོས་ཡང་དག་པར་བརྗོད་པ་མཆིས།
en: There is a Dharma discourse for those who do not aggrandize themselves or regard others as beneath them.

source: བཅོམ་ལྡན་འདས་གང་མཉམ་པ་རྣམས་ལ་ཡང་མཉམ། མི་མཉམ་པ་རྣམས་ལ་ཡང་མཉམ། མཉམ་པ་དང་མི་མཉམ་པ་རྣམས་ལ་ཡང་མཉམ་ཞིང་། མཉམ་པ་དང་མི་མཉམ་པར་ཡང་མི་རྟོག་པ་དེ་དག་ལ་ཆོས་ཡང་དག་པར་བརྗོད་པ་མཆིས།
en: Blessed One, there is a Dharma discourse for those who regard those equal to them as equal, those not equal as equal, those neither equal nor not equal as equal, and those who do not hold concepts of being equal or unequal.

source: བཅོམ་ལྡན་འདས་གང་ཚིག་གཅིག་ཐོས་པས་ཚིག་བརྒྱ་སྟོང་གི་དོན་དང་ལེའུ་ལ་འཇུག་ཅིང་ཁོང་དུ་ཆུད་དེ། དོན་དང་གཞུང་ལ་གཉིས་སུ་འདུ་ཤེས་མི་འགྱུར་བ་དེ་དག་ལ་ཆོས་ཡང་དག་པར་བརྗོད་པ་མཆིས། བཅོམ་ལྡན་འདས་གང་ཆོས་ཐོས་ནས་ཞི་བར་ཡང་མི་འགྱུར། གཡེང་བར་ཡང་མི་འགྱུར་བ་དང་། གང་ཆོས་ཐོས་ནས་འཆིང་བར་ཡང་མི་འགྱུར། ཐར་པར་ཡང་མི་འགྱུར་བ་དང་།
en: Blessed One, there is a Dharma discourse for those who hear a single word and then take from it and understand the meaning and arrangement of a hundred thousand words, and who do not distinguish between text and meaning.

source: གང་ཆོས་ཐོས་ནས་འཇུག་པར་ཡང་མི་འགྱུར། ལྡོག་པར་ཡང་མི་འགྱུར་བ་དང་། གང་ཆོས་ཐོས་ནས་བྲི་བར་ཡང་མི་འགྱུར། གང་བར་ཡང་མི་འགྱུར་བ་དང་། གང་ཆོས་ཐོས་ནས་དད་པར་ཡང་མི་འགྱུར། ཁྲོ་བར་ཡང་མི་འགྱུར་བ་དང་།
en: Blessed One, there is a Dharma discourse for those who are neither calmed nor distracted after hearing the Dharma, who are neither bound nor free after hearing the Dharma, who neither accept nor reject after hearing the Dharma, who neither diminish nor increase after hearing the Dharma, who feel neither faith nor hostility after hearing the Dharma, and who neither remain in saṃsāra nor pass into nirvāṇa after hearing the Dharma.

source: གང་ཆོས་ཐོས་ནས་འཁོར་བར་ཡང་མི་འགྱུར། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་ཡང་མི་འགྱུར་བ་དང་། བཅོམ་ལྡན་འདས་གང་ཆོས་ཡང་དག་པར་བརྗོད་པས་ཆོས་ཉིད་འདི་རྗེས་སུ་རྟོགས་པ་དེ་དག་ལ་ཆོས་ཡང་དག་པར་བརྗོད་པ་མཆིས་པ་སྙམ་བགྱིད་ན།
en: “Blessed One, I wonder if there is a Dharma discourse for those who realize the basic nature through this Dharma discourse.

source: བཅོམ་ལྡན་འདས་བདག་མཆི་བ་ལྟ་བུ་ཆོས་ཡང་དག་པར་བརྗོད་པ་དང་འཐུན་པ་ལྟ་ལགས་སམ།
en: Blessed One, do you consider what I have said to be in accord with the Dharma discourse already given?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤཱ་རིའི་བུ་ཁྱོད་ཀྱི་འདི་ནི་ཆོས་ཡང་དག་པར་རྗོད་པ་དང་འཐུན་པ་ཡིན་ནོ། །
en: The Blessed One replied, “Śāriputra, your Dharma discourse is in accord.

source: ཤཱ་རིའི་བུ་གང་ཁྱོད་ཀྱིས་བཤད་པ་འདི་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཆོས་རྣམས་རྗེས་སུ་ཤེས་པ་ཡིན་ནོ། །
en: Śāriputra, your explanation demonstrates an understanding of the Dharma teachings of the thus-gone ones of the past, future, and present.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་གང་འདི་སྙམ་དུ་བདག་གིས་ཆོས་ཡང་དག་པར་བརྗོད་པར་བྱའོ་སྙམ་དུ་སེམས་པ་དེ་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་བགྱི་བར་རྔོ་མི་ཐོགས་སོ། །
en: The venerable Mahāmaudgalyāyana next addressed the Blessed One: “Blessed One, bodhisattvas who think, ‘I should discourse on the Dharma,’ are incapable of discoursing on the Dharma.

source: བདག་ཏུ་ལྟ་བར་གྱུར་ནས་འདི་སྙམ་དུ་བདག་ནི་འཆད་དོ། །འདི་ནི་ཉན་ནོ་སྙམ་དུ་སེམས་པའི་སླད་དུའོ། །
en: Because they believe in a self and think, ‘I teach, they listen.’

source: གང་བདག་ཏུ་འདུ་ཤེས་པ་དང་བྲལ་བ་དེ་དག་ནི་བདག་ཏུ་སྒྲོ་བཏགས་ནས་ཆོས་སྟོན་པ་མ་ལགས། གཞན་དུ་སྒྲོ་བཏགས་ནས་མ་ལགས། གཉི་གར་སྒྲོ་བཏགས་ནས་མ་ལགས།
en: Those lacking the perception of a self do not teach the Dharma after imputing a self, after imputing an other, or after imputing both.

source: བག་ལ་ཉལ་དུ་བཏགས་ནས་མ་ལགས་སོ། །
en: They do not teach after forming latent impressions.

source: བཅོམ་ལྡན་འདས་སྒྲོ་བཏགས་པ་ཐམས་ཅད་ནི་མ་མཆིས་པ་ལས་སྒྲོ་བཏགས་པའི་སླད་དུའོ། །
en: Blessed One, it is because all imputations are imputations based on nothing.

source: བཅོམ་ལྡན་འདས་ཆོས་གང་སྒྲོ་བཏགས་པ་དེ་ནི་རྫས་སུ་མ་མཆིས་པ་ལགས་སོ། །
en: Blessed One, an imputed phenomenon does not substantially exist.

source: དེ་ལ་སྒྲོ་བཏགས་པ་རྣམས་ཡོངས་སུ་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་གང་སྒྲོ་བཏགས་པ་དེ་ནི་ཆོས་སོ། །
en: To elaborate, the Dharma is an imputation made by bodhisattva great beings who understand imputations.

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། དཔེར་ན་སྒྱུ་མ་སྤྲུལ་པའི་བརྗོད་པ་བཞིན་དུ་སྒྲོ་བཏགས་པ་ཡོངས་སུ་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའི་སྒྲོ་བཏགས་པ་ཡང་དེ་བཞིན་ནོ། །
en: Blessed One, the imputations of a bodhisattva who understands imputations are similar to describing a magical illusion.

source: བཅོམ་ལྡན་འདས་སྒྲོ་བཏགས་པ་སྒྲོ་བཏགས་པ་ཞེས་བགྱི་བ་བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན་སྒྲོ་བཏགས་པ་ཞེས་བགྱི་ཞེ་ན། སྒྲོ་བཏགས་པ་གང་སྟོང་པ་ཉིད་དང་།
en: Blessed One, an imputation is called an imputation, so what is meant by ‘imputation,’ Blessed One?

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མི་སྤོང་བ་དང་། མི་སྐྱེ་བ་དང་མི་འགག་པ་དང་འཐུན་པ་རྟོག་པ་དང་རྣམ་པར་རྟོག་པ་དང་། ཡོངས་སུ་རྟོག་པར་འདོར་བ། ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་ཡང་དག་པར་གཅོད་པ།
en: It is an imputation to not reject emptiness and dependent arising; it is to be in accord with the unarisen and unceasing; it is the transcendence of ideas, concepts, and paradigms; it is the disruption of clinging to ‘I’ and ‘mine’; it is the clearing away of all adopted views.

source: ལྟ་བར་གྱུར་པ་ཐམས་ཅད་སེལ་བ་དེ་ནི་སྒྲོ་བཏགས་པ་ཡོངས་སུ་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་སྒྲོ་བཏགས་པ་ལགས་སོ། །
en: That is the imputation of bodhisattva great beings who understand imputation.

source: གང་སྒྲོ་བཏགས་པ་འདི་དེ་ལྟར་ཁོང་དུ་ཆུད་པ་དེ་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་ལགས་སོ། །
en: That which leads to this understanding of imputation is a discourse on the Dharma.

source: བཅོམ་ལྡན་འདས་གང་ཆོས་ཡང་དག་པར་བརྗོད་པ་དང་། གང་ཆོས་ཡང་དག་པར་བརྗོད་པ་པོ་དང་། གང་དག་ལ་ཆོས་ཡང་དག་པར་བརྗོད་པ་དེ་དག་ཐམས་ཅད་ནི་འདི་ལྟ་སྟེ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་མཚན་ཉིད་དུ་མཚན་ཉིད་གཅིག་གོ། །
en: “Blessed One, a Dharma discourse, the one who discourses on the Dharma, and those who receive a Dharma discourse are all like this: they have the sole characteristic of being identified as the expanse of phenomena.

source: གང་འདི་ལྟར་ཆོས་ཡང་དག་པར་བརྗོད་པ་འདི་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་ལགས་པ་སྙམ་བགྱིད་ན།
en: I wonder if this is a discourse on the Dharma?

source: བཅོམ་ལྡན་འདས་བདག་གི་ཆོས་ཡང་དག་པར་བརྗོད་པ་དང་འཐུན་པ་ལྟ་ལགས་སམ།
en: Blessed One, do you consider my discourse on the Dharma in accord with those already given?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། མཽད་གལ་གྱི་བུ་ཁྱོད་ཀྱི་འདི་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་དང་འཐུན་ནོ། །
en: The Blessed One said, “Maudgalyāyana, your Dharma discourse is in accord.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་བྱམས་མའི་བུ་གང་པོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་གང་བསོད་ནམས་ཚོལ་བས་ཆོས་ཡང་དག་པར་བརྗོད་པར་བགྱིད་པ་དེ་ནི་དེའི་ཆོས་ཡང་དག་པར་བརྗོད་པར་སྐྱོན་ཆགས་པ་ལགས་སོ། །
en: The venerable Pūrṇa Maitrāyaṇīputra next addressed the Blessed One: “Blessed One, a Dharma discourse by one who seeks merit is a flawed Dharma discourse.

source: བཅོམ་ལྡན་འདས་བདག་ཏུ་མངོན་པར་ཆགས་པས་མངོན་པར་ཞེན་པ་ནི་བསོད་ནམས་དང་། བསོད་ནམས་མ་ལགས་པ་དང་། མི་གཡོ་བའི་འདུ་བྱེད་མངོན་པར་འདུ་བགྱིད་དོ། །
en: Blessed One, someone who is attached to the self has habitual adherence and creates karmic formations that are meritorious, demeritorious, and static.

source: བདག་ཏུ་མངོན་པར་ཆགས་པས་མངོན་པར་ཞེན་པ་ནི་ལྟ་བ་རྣམས་དང་། ལྟ་བར་གྱུར་པ་རྣམས་ལས་རྣམ་པར་མ་གྲོལ་ཏེ།
en: Someone who is attached to the self has habitual adherence and has not freed themselves from views or the holding of views.

source: བདག་ལ་སྨན་པ་དང་། གཞན་ལ་སྨན་པར་བགྱིད་པ་རྔོ་མི་ཐོགས་སོ། །
en: They are unable to heal themselves or others.

source: བཅོམ་ལྡན་འདས་གང་བདག་ལ་ཡང་མི་སྨན། གཞན་ལ་ཡང་མི་སྨན་པ་ཇི་ལྟར་ཆོས་ཡང་དག་པར་བརྗོད་པར་བགྱིད་པར་འགྱུར།
en: Blessed One, how could someone who is unable to heal themselves or others give a discourse on the Dharma?

source: བཅོམ་ལྡན་འདས་གང་ཆོས་འཚལ་བ་དེ་ནི་བསོད་ནམས་དང་། བསོད་ནམས་མ་ལགས་པ་དང་། མི་གཡོ་བའི་འདུ་བྱེད་ཚོལ་བ་ཡང་མ་ལགས། མི་ཚོལ་བ་ཡང་མ་ལགས་སོ། །གང་ཆོས་ཀུན་འཚལ་བ་དེ་ནི་ཕུང་པོ་རྣམས་ཚོལ་བ་ཡང་མ་ལགས། མི་ཚོལ་བ་ཡང་མ་ལགས་སོ། །ཁམས་རྣམས་ཚོལ་བ་ཡང་མ་ལགས། མི་ཚོལ་བ་ཡང་མ་ལགས་སོ། །སྐྱེ་མཆེད་རྣམས་ཚོལ་བ་ཡང་མ་ལགས། །མི་ཚོལ་བ་ཡང་མ་ལགས་སོ། །དེ་ནི་སེམས་ཅན་རྣམས་ཚོལ་བ་ཡང་མ་ལགས། མི་ཚོལ་བ་ཡང་མ་ལགས་སོ། །དེ་ནི་ཆོས་རྣམས་ཚོལ་བ་ཡང་མ་ལགས། མི་ཚོལ་བ་ཡང་མ་ལགས་སོ། །དེ་ནི་བདེན་པ་ཚོལ་བ་ཡང་མ་ལགས། བརྫུན་པ་ཚོལ་བ་ཡང་མ་ལགས་སོ། །དེ་ནི་ཡུལ་ཚོལ་བ་ཡང་མ་ལགས། ཡུལ་རྣམས་ལས་འབྱུང་བ་ཚོལ་བ་ཡང་མ་ལགས་སོ། །དེ་ནི་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཚོལ་བ་ཡང་མ་ལགས། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྤོང་བ་ཚོལ་བ་ཡང་མ་ལགས་སོ། །དེ་ནི་འཁོར་བ་ཚོལ་བ་ཡང་མ་ལགས། མྱ་ངན་ལས་འདས་པ་ཚོལ་བ་ཡང་མ་ལགས་སོ། །དེ་ནི་འཐབ་པ་དང་རྩོད་པ་དང་འགྱེད་པ་ཚོལ་བ་ཡང་མ་ལགས། ཅང་མི་སྨྲ་བ་ཚོལ་བ་ཡང་མ་ལགས་སོ། །སྟོང་པ་ཉིད་ཚོལ་བ་ཡང་མ་ལགས། ལྟ་བར་གྱུར་པ་རྣམས་ཚོལ་བ་ཡང་མ་ལགས་སོ། །མཚན་མ་མ་མཆིས་པ་ཚོལ་བ་ཡང་མ་ལགས།
en: Blessed One, someone who seeks the Dharma neither seeks karmic formations that are meritorious, demeritorious, and static, nor does not seek them.
